{"target":"http://pubannotation.org/docs/sourcedb/PubMed/sourceid/19832944","sourcedb":"PubMed","sourceid":"19832944","text":"CBL-mediated targeting of CIPKs facilitates the decoding of calcium signals emanating from distinct cellular stores.\nDuring adaptation and developmental processes cells respond through nonlinear calcium-decoding signaling cascades, the principal components of which have been identified. However, the molecular mechanisms generating specificity of cellular responses remain poorly understood. Calcineurin B-like (CBL) proteins contribute to decoding calcium signals by specifically interacting with a group of CBL-interacting protein kinases (CIPKs). Here, we report the subcellular localization of all 10 CBL proteins from Arabidopsis and provide a cellular localization matrix of a plant calcium signaling network. Our findings suggest that individual CBL proteins decode calcium signals not only at the plasma membrane and the tonoplast, but also in the cytoplasm and nucleus. We found that distinct targeting signals located in the N-terminal domain of CBL proteins determine the spatially discrete localization of CBL/CIPK complexes by COPII-independent targeting pathways. Our findings establish the CBL/CIPK signaling network as a calcium decoding system that enables the simultaneous specific information processing of calcium signals emanating from different intra- and extracellular stores, and thereby provides a mechanism underlying the specificity of cellular responses.","project":"LocText","denotations":[{"id":"T1","span":{"begin":624,"end":635},"obj":"taxonomy:3702"},{"id":"T2","span":{"begin":806,"end":821},"obj":"go:GO:0005886"},{"id":"T3","span":{"begin":830,"end":839},"obj":"go:GO:0005774"},{"id":"T4","span":{"begin":857,"end":866},"obj":"go:GO:0005737"},{"id":"T5","span":{"begin":871,"end":878},"obj":"go:GO:0005634"},{"id":"T6","span":{"begin":1279,"end":1292},"obj":"go:GO:0005576"}],"namespaces":[{"prefix":"uniprot","uri":"http://identifiers.org/uniprot/"},{"prefix":"taxonomy","uri":"http://identifiers.org/taxonomy/"},{"prefix":"go","uri":"http://identifiers.org/go/"}]}