{"target":"http://pubannotation.org/docs/sourcedb/PubMed/sourceid/16874308","sourcedb":"PubMed","sourceid":"16874308","text":"Yeast homolog of a cancer-testis antigen defines a new transcription complex.\nWe have isolated a new yeast gene (PCC1) that codes for a factor homologous to human cancer-testis antigens. We provide evidence that Pcc1p is a new transcription factor and that its mutation affects expression of several genes, some of which are involved in cell cycle progression and polarized growth. Mutation of Pcc1p also affects the expression of GAL genes by impairing the recruitment of the SAGA and Mediator co-activators. We characterize a new complex that contains Pcc1p, a kinase, Bud32p, a putative endopeptidase, Kae1p and two additional proteins encoded by ORFs YJL184w and YMLO36w. Genetic and physical interactions among these proteins strongly suggest that this complex is a functional unit. Chromatin immunoprecipitation experiments and multiple genetic interactions of pcc1 mutants with mutants of the transcription apparatus and chromatin modifying enzymes underscore the direct role of the complex in transcription. Functional complementation experiments indicate that the transcriptional function of this set of genes is conserved throughout evolution.","project":"LocText","denotations":[{"id":"T1","span":{"begin":0,"end":5},"obj":"taxonomy:4932"},{"id":"T2","span":{"begin":101,"end":106},"obj":"taxonomy:4932"},{"id":"T3","span":{"begin":113,"end":117},"obj":"uniprot:Q3E833"},{"id":"T4","span":{"begin":157,"end":162},"obj":"taxonomy:9606"},{"id":"T5","span":{"begin":212,"end":217},"obj":"uniprot:Q3E833"},{"id":"T6","span":{"begin":394,"end":399},"obj":"uniprot:Q3E833"},{"id":"T7","span":{"begin":554,"end":559},"obj":"uniprot:Q3E833"},{"id":"T8","span":{"begin":571,"end":577},"obj":"uniprot:P53323"},{"id":"T9","span":{"begin":605,"end":610},"obj":"uniprot:P36132"},{"id":"T10","span":{"begin":655,"end":662},"obj":"uniprot:P46984"},{"id":"T11","span":{"begin":667,"end":674},"obj":"uniprot:uniprot:"},{"id":"T12","span":{"begin":867,"end":871},"obj":"uniprot:Q3E833"}],"namespaces":[{"prefix":"uniprot","uri":"http://identifiers.org/uniprot/"},{"prefix":"taxonomy","uri":"http://identifiers.org/taxonomy/"},{"prefix":"go","uri":"http://identifiers.org/go/"}]}